Revit 2027 API
ExternalDataManagerDataItem.Status Property
 The status of the data item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkedFileStatus Status { get; set; }
Public Property Status As LinkedFileStatus
	Get
	Set
public:
property LinkedFileStatus Status {
	LinkedFileStatus get ();
	void set (LinkedFileStatus value);
}
member Status : LinkedFileStatus with get, set
Property Value
LinkedFileStatus
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The default value is LinkedFileStatus::Invalid, means this property is nonsense.
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace